{
  "Scenario 2.2 Avie Products Inc. is planning to add a third shift to its production schedule. It currently has 450 workers involved in all aspects of its fertilizer business, best done in Canada. A recent surge in demand from its global customers is driving the need for more workers; however, Simi Meher, the CEO, is concerned that the surge may be temporary, especially in light of the recent economic downturns in the global environment where Avie does business. Refer to Scenario 2.2. Which approach could Avie use to forecast demand for its products? staffing tables Markov analysis skill inventories trend analysis": "",
  "Scenario 3.1 The Furniture Emporium Inc. is a Canadian-based international manufacturer and distributor of high-end furniture for offices and homes. Since 2010, it has been expanding into the emerging markets across the globe. The company’s workforce is representative of the population. As well, women make up 58 percent of the company’s workforce. However, while these groups are well represented in the organization, they are not seen in the same percentage as a part of the senior management structure of the organization. While Furniture Emporium hires for diversity, it does not use its employees’ diverse skills and abilities to enhance its global potential, given the international nature of its business. Refer to Scenario 3.1. Which of the following is a good way for Furniture Emporium to gain a strategic and competitive advantage, through its employees, in the international furniture market? hire for diversity ensure pay equity is implemented manage diversity effectively promote employees from the designated groups": "",
  "Refer to Scenario 3.1. Which of the following accurately represents diversity management if Furniture Emporium were to use it as a strategic tool?": "",
  "Scenario 3.2 Metro Business is a growing firm located in Calgary, Alberta. The CEO, Niri Malo, has noticed that most of the recent applications for positions in the organization are self-identified persons from the four designated groups covered by employment equity legislation in Canada. Ms. Malo has heard of the benefits of a diversity workforce and wants to implement an employment equity plan. She understands, however, that there may be challenges in implementing it. Refer to Scenario 3.2. What is one reason for Metro Business to have an employment equity plan? They would like access to the Federal Contractors Program. It is required for all firms in Canada. It will address pay equity problems. It will prevent racism in the organization.": "",
  "Refer to Scenario 3.2. What is the first step in establishing the employment equity plan at Metro Business?": "",
  "Refer to Scenario 3.2. Which of the following is NOT one of the four designated groups covered by the federal Employment Equity Act?": "",
  "Refer to Scenario 5.1. Adopting a realistic job preview at BI Inc. can lead to which of the following?": "",
  "Scenario 6.2 Computer Direct Inc. is a mid-sized technology firm that specializes in designing, manufacturing, and selling computers. The organization staff complement is very diverse, and most of the company’s employees are in the development and design, sales, and marketing departments. Computer Direct has been using only one method to make recruitment decisions for all of its employees, from managerial to technical to clerical. Data is gathered on each candidate, and a committee assigns scores to candidates based on its understanding of the job. Candidates, however, are not given the opportunity to be tested and hired based on their respective scores. Essentially, decisions are made based on personal judgments. Refer to Scenario 6.2. Which approach best reflects how decisions about recruiting are made at Computer Direct? psychological approach clinical approach statistical approach behavioural approach": "",
  "Accounting Power Inc. is a Canadian employment agency that provides professional accounting services to various businesses across the country. In the last couple of years, the firm has been slowly losing clients, which is impacting its bottom line. Interviews done with some clients revealed that Accounting Power Inc. employees are not as sharp as they used to be and, lately, there have been too many inconsistencies and errors with their work. In the last recession, managers could not justify how the training was adding value to the agency. These programs were not viewed as strategic imperatives and most of them were cut. Refer to Scenario 7.1. Accounting Power Inc. is losing its clients because it did not accurately do which of the following? design the right training programs to help its employees succeed hire the right trainers to run the programs assess the extent to which training programs improve learning and behaviour on the job and eventually impact their performance evaluate participants’ reactions": "",
  "Refer to Scenario 7.1. If Accounting Power Inc. wanted to evaluate its training programs, what are the four basic criteria for such an evaluation?": "",
  "Refer to Scenario 7.1. The combination of these four criteria—reactions, learning, behaviour, and results—can give a total picture of the training program to help managers decide all of the following EXCEPT which one?": "",
  "Scenario 7.2 Blake Windows & Doors Inc. installs and repairs doors and windows for Green Park Homes. When the firm started back in the 1980s, its operations were based only in Vancouver. Today, Blake is the main contractor for Green Park Homes across British Columbia. Employees with Blake work long hours, especially when new subdivisions are being built. The company now wants to increase its staff complement to help deal with increasing demands while maintaining some work–life balance. Blake found that employees from agencies tend to need too much hands-on training, which is costly, and if they do have some experience it is very costly to hire them due to the specific set of skills required. Refer to Scenario 7.2. Which of the following is the most appropriate method for developing workers who can effectively help Blake Windows & Doors deal with its increasing commitments while keeping payroll and training costs down? internship programs agency recruitment with more in-house training apprenticeship programs mentorship programs": "",
  "Refer to Scenario 7.2. Assume that on-the-job-training is the best option to help Blake increase its employee base. Which of the following is NOT a drawback of on-the-job-training?": "",
  "Refer to Scenario 7.2. If Blake adopts an apprenticeship program, which of the following is NOT true about how trainees are developed?": ""
}